[
	{
		"id": "Avro Lancaster",
		"content": "The Avro Lancaster is a British Second World War heavy bomber. It was designed and manufactured by Avro as a contemporary of the Handley Page Halifax, both bombers having been developed to the same specification, as well as the Short Stirling, all three aircraft being four-engined heavy bombers adopted by the Royal Air Force (RAF) during the same wartime era.
The Lancaster has its origins in the twin-engine Avro Manchester which had been developed during the late 1930s in response to the Air Ministry Specification P.13/36 for a capable medium bomber for \"world-wide use\". Originally developed as an evolution of the Manchester (which had proved troublesome in service and was retired in 1942), the Lancaster was designed by Roy Chadwick and powered by four Rolls-Royce Merlins and in one version, Bristol Hercules engines. It first saw service with RAF Bomber Command in 1942 and as the strategic bombing offensive over Europe gathered momentum, it was the main aircraft for the night-time bombing campaigns that followed. As increasing numbers of the type were produced, it became the principal heavy bomber used by the RAF, the RCAF and squadrons from other Commonwealth and European countries serving within the RAF, overshadowing the Halifax and Stirling.A long, unobstructed bomb bay meant that the Lancaster could take the largest bombs used by the RAF, including the 4,000 lb (1,800 kg), 8,000 lb (3,600 kg) and 12,000 lb (5,400 kg) blockbusters, loads often supplemented with smaller bombs or incendiaries. The \"Lanc\", as it was known colloquially, became one of the most heavily used of the Second World War night bombers, \"delivering 608,612 long tons of bombs in 156,000 sorties\". The versatility of the Lancaster was such that it was chosen to equip 617 Squadron and was modified to carry the Upkeep \"bouncing bomb\" designed by Barnes Wallis for Operation Chastise, the attack on German Ruhr valley dams. Although the Lancaster was primarily a night bomber, it excelled in many other roles, including daylight precision bombing, for which some Lancasters were adapted to carry the 12,000 lb (5,400 kg) Tallboy and then the 22,000 lb (10,000 kg) Grand Slam earthquake bombs (also designed by Wallis). This was the largest payload of any bomber in the war.
In 1943, a Lancaster was converted to become an engine test bed for the Metropolitan-Vickers F.2 turbojet. Lancasters were later used to test other engines, including the Armstrong Siddeley Mamba and Rolls-Royce Dart turboprops and the Avro Canada Orenda and STAL Dovern turbojets. Postwar, the Lancaster was supplanted as the main strategic bomber of the RAF by the Avro Lincoln, a larger version of the Lancaster. The Lancaster took on the role of long range anti-submarine patrol aircraft (later supplanted by the Avro Shackleton) and air-sea rescue. It was also used for photo-reconnaissance and aerial mapping, as a flying tanker for aerial refuelling and as the Avro Lancastrian, a long-range, high-speed, transatlantic passenger and postal delivery airliner. In March 1946, a Lancastrian of BSAA flew the first scheduled flight from the new London Heathrow Airport.",
		"image": "Avro Lancaster.jpg"
	}
]