[
	{
		"id": "CD Projekt",
		"content": "CD Projekt S.A. (Polish: [ˌt͡sɛˈdɛ ˈprɔjɛkt]) is a Polish video game developer, publisher and distributor based in Warsaw, founded in May 1994 by Marcin Iwiński and Michał Kiciński. Iwiński and Kiciński were video game retailers before they founded the company, which initially acted as a distributor of foreign video games for the domestic market. The department responsible for developing original games, CD Projekt Red, best known for The Witcher series, was formed in 2002. In 2008, CD Projekt launched the digital distribution service GOG.com (originally as Good Old Games).
The company began by translating major video-game releases into Polish, collaborating with Interplay Entertainment for two Baldur's Gate games. CD Projekt was working on the PC version of Baldur's Gate: Dark Alliance when Interplay experienced financial difficulties. The game was cancelled and the company decided to reuse the code for their own video game. It became The Witcher, a video game based on the works of Andrzej Sapkowski.
After the release of The Witcher, CD Projekt worked on a console port called The Witcher: White Wolf; but development issues and increasing costs almost led the company to the brink of bankruptcy. CD Projekt later released The Witcher 2: Assassins of Kings in 2011 and The Witcher 3: Wild Hunt in 2015, with the latter winning various Game of the Year awards. In 2020, the company released Cyberpunk 2077, an open-world role-playing game based on the Cyberpunk 2020 tabletop game system, for which it opened a new division in Wrocław.
A video game distribution service, GOG.com, was established by CD Projekt to help players find old games. Its mission is to offer games free of digital rights management (DRM) to players and its service was expanded to cover new AAA and independent games.
In 2009, CD Projekt's then-parent company, CDP Investment, announced its plans to merge with Optimus S.A. in a deal intended to reorganise CD Projekt as a publicly traded company. The merger was closed in December 2010 with Optimus as the legal surviving entity; Optimus became the current incarnation of CD Projekt S.A. in July 2011. By September 2017, it was the largest publicly traded video game company in Poland, worth about US$2.3 billion, and by May 2020, had reached a valuation of US$8.1 billion, making it the largest video game industry company in Europe ahead of Ubisoft. CD Projekt joined WIG20, an index of the 20 largest companies on the Warsaw Stock Exchange, in March 2018.",
		"image": "CD Projekt.jpg"
	}
]