[
	{
		"id": "China and the United Nations",
		"content": "China is one of the charter members of the United Nations and is one of five permanent members of its Security Council.
One of the victorious Allies of the Second World War (locally known as the Second Sino-Japanese War), the Republic of China (ROC) joined the UN upon its founding in 1945. The subsequent resumption of the Chinese Civil War led to the establishment of the People's Republic of China (PRC) in 1949. Nearly all of the Chinese mainland was soon under its control and the ROC retreated to the island refuge of Taiwan. The One-China policy advocated by both governments dismantled the solution of dual representation but, amid the Cold War and Korean War, the United States and its allies opposed the replacement of the ROC at the United Nations until 1971, although they were persuaded to pressure the government of the ROC to accept international recognition of Mongolia's independence in 1961. The United Kingdom, France, and other United States allies individually shifted their recognitions of China to the PRC and Albania brought annual votes to replace the ROC with the PRC, but these were defeated since—after General Assembly Resolution 1668—a change in recognition required a two-thirds vote.
Amid the Sino-Soviet split and Vietnam War, United States President Richard Nixon entered into negotiations with Communist Chairman Mao, initially through a secret 1971 trip undertaken by Henry Kissinger to visit Zhou Enlai. On 25 October 1971, Albania's motion to recognize the People's Republic of China as the sole legal China was passed as General Assembly Resolution 2758. It was supported by most of the communist states (including the Soviet Union) and non-aligned countries (such as India), but also by some NATO countries such as the United Kingdom and France. After the PRC was seated on 15 November 1971, Nixon then personally visited mainland China the next year, beginning the normalization of PRC-US relations. Since that time, the Republic of China has softened its own One-China Policy and sought international recognition. These moves have been opposed and mostly blocked by the People's Republic of China, forcing the Republic of China to join international organizations under other names, including \"Chinese Taipei\" at the International Olympic Committee.
The Republic of China's most recent request for admission was turned down in 2007, but a number of European governments—led by the United States—protested to the UN's Office of Legal Affairs to force the global body and its secretary-general to stop using the reference “Taiwan is a part of China”.",
		"image": "China and the United Nations.jpg"
	}
]