[
	{
		"id": "COSMAC VIP",
		"content": "The COSMAC VIP (1977) was an early microcomputer that was aimed at video games. Essentially, it was a COSMAC ELF with a supplementary CDP1861/CDP1864 video display chip. For a price of US$275, it could be purchased from RCA by mail order. It came in kit form, and had to be assembled. Its dimensions were 22 x 28 cm, and it had a RCA 1802 processor; along with a crystal clock operating at 1.76 MHz. It had 2 KB (2048 bytes) of RAM, which could be expanded to 4 KB on board, and 32 KB via an expansion slot. Its 5V DC CDP18S023 power supply had an output of 600 mA. I/O ports could be added to connect to sensors, interface relays, an ASCII keyboard, or a printer.
The machine connected to either a video monitor or to a TV with video input or by means of an external RF modulator.  The VIP used a CDP1861/CDP1864 video display chip to generate the video output, and sound could be played using its integrated speaker. It had a 100 bytes per second cassette tape interface as well. Programs could be loaded into RAM from tapes, and vice versa. It also had a hex keyboard for input, which had 16 keys spanning the hex digits 0 to F. LED indicators were used to display power status and tape input; a third LED along with an on-board beeper were activated by the CPU's 1-bit \"Q\" register. A run/reset switch was used to start user programs or the operating system, respectively.
A simple 4-kilobit (512-byte) operating system was built into its ROM. It allowed one to type in programs using its hex keyboard, show memory contents on its display (step through the bytes of RAM), and view the values of the processor registers. The ROM monitor was accessed by holding the \"C\" key while switching from Reset to Run. The COSMAC VIP was shipped with 20 video games, which were programmed in CHIP-8. CHIP-8 was an early interpreted programming language that was used on this machine and other early microcomputers, such as the Telmac 1800.  The video games that were provided came as a list of instructions that had to be typed in by the user.
The COSMAC VIP was created by Joseph Weisbecker of the RCA Laboratories in New Jersey. His daughter Joyce created some of the games included with it. RCA sold a $39 version of Tiny BASIC on an expansion board.A VIP II version was designed, bundling the VIP with several expansion cards and selling it in fully assembled form. Marketing materials from 1979 refer to a 1980 release, but this never occurred. Several years later the VIP II was equipped with a ROM containing a terminal program and sold as a portable terminal device under the name RCA VP 3000.",
		"image": "COSMAC VIP.jpg"
	}
]