[
	{
		"id": "DNA and RNA codon tables",
		"content": "A codon table can be used to translate a genetic code into an amino acid sequence. The standard genetic code is traditionally represented as an RNA codon table, because when proteins are made in a cell by ribosomes, it is mRNA that directs protein synthesis. The mRNA sequence is determined by the sequence of genomic DNA. In such context, the standard genetic code is referred to as translation table 1. It can also be represented in a DNA codon table. The DNA codons in such tables occur on the sense DNA strand and are arranged in a 5' → 3' direction. Different tables with alternate codons are used depending on the source of the genetic code, such as from a cell nucleus, mitochondrion, plastid, or hydrogenosome.There are 64 different codons in the genetic code and the below tables; all but three specify an amino acid. These three other codons, deemed stop codons, have specific names: UAG is amber, UGA is opal orumber, and UAA is ochre. Also called \"termination\" or \"nonsense\" codons, these sequences signal the release of the nascent polypeptide from the ribosome. Another three codons, which specify an amino acid, are called start codons. The most common start codon is AUG, which is read as methionine. Alternative start codons depending on the organism include \"GUG\" or \"UUG\"; these codons normally represent valine and leucine, respectively, but as start codons they are translated as methionine or formylmethionine. The start codons, along with sequences such as an initiation factor, initiate translation.The first table—the standard table—can be used to translate nucleotide triplets into the corresponding amino acid or appropriate signal if it is a start or stop codon. The second table, appropriately called the inverse, does the opposite: it can be used to deduce a possible triplet code if the amino acid is known. As multiple codons can code for the same amino acid, the International Union of Pure and Applied Chemistry's (IUPAC) nucleic acid notation is given in some instances.

",
		"image": "DNA and RNA codon tables.jpg"
	}
]