[
	{
		"id": "Lifeboats of the Titanic",
		"content": "The lifeboats of the RMS Titanic played a crucial role in the disaster of 14–15 April 1912. One of the ship's legacies was that she had 20 lifeboats that in total could only accommodate 1,178 people, despite the fact that there were approximately 2,208 on board. RMS Titanic had a maximum capacity of 3,547 passengers and crew.
18 lifeboats were used, loading between 11:45 p.m. and 2:15 a.m., though Collapsible Boat A floated off the ship's partially submerged deck, and Collapsible Boat B floated away upside down minutes before the ship upended and sank.
Many lifeboats only carried half of their maximum capacity; there are many versions as to the reasoning behind half-filled lifeboats. Some sources claimed they were afraid of the lifeboat buckling under the weight, others suggested it was because the crew were following orders to evacuate women and children first. As the half-filled boats rowed away from the ship, they were too far for other passengers to reach, and most lifeboats did not return to the wreck, due to fear of being swamped by drowning victims. Only lifeboats 4 and 14 returned to retrieve survivors from the water, some of whom later died.
RMS Carpathia did not reach the lifeboats until 4 a.m., one hour and forty minutes after Titanic sank to the bottom of the sea according to generally accepted reports, and the rescue continued until the last lifeboat was collected at 8:30 a.m.
Although the number of lifeboats was insufficient, Titanic was in compliance with maritime safety regulations of the time. The sinking showed that the regulations were outdated for such large passenger ships. The Inquiry also revealed White Star Line wanted fewer boats on the decks, to provide unobstructed views for passengers and give the ship more aesthetics from an exterior viewpoint. In the event of an emergency, it was not anticipated that all passengers and crew would require evacuation at the same time, as it was believed Titanic would float for long enough to allow a transfer of passengers and crew to a rescue vessel.
Compounding the disaster, Titanic's crew were poorly trained on using the davits (lifeboat launching equipment). As a result, boat launches were slow, improperly executed, and poorly supervised. These factors contributed to the lifeboats departing with only half capacity.
1,503 people did not make it on to a lifeboat and were aboard Titanic when she sank to the bottom of the North Atlantic Ocean. 705 people remained in the lifeboats until later that morning when they were rescued by RMS Carpathia. Those aboard the lifeboats were picked up by Carpathia over the course of 4 hours and 30 minutes, from about 4 a.m. to 8:30 a.m., and 13 of the lifeboats were also taken aboard. The lifeboats were returned to the White Star Line at New York Harbor, as they were the only items of value salvaged from the shipwreck, but subsequently vanished from history over time.",
		"image": "Lifeboats of the Titanic.jpg"
	}
]