[
	{
		"id": "List of songs in Rock Band",
		"content": "Rock Band is a 2007 music video game developed by Harmonix and distributed by MTV Games and Electronic Arts. The game is available for the Xbox 360, PlayStation 2, PlayStation 3, and Wii game consoles.  Rock Band is based on Harmonix's previous success with the Guitar Hero series of video games in which players used a guitar-shaped controller to simulate playing rock music.  Rock Band expands on the concept by adding a drum and microphone peripheral, allowing up to four players to participate in the game, playing lead and bass guitar, drums, and vocals.   The gameplay in Rock Band is comparable to that in Guitar Hero along with elements from Harmonix' Karaoke Revolution.
Rock Band for the Xbox 360 and PlayStation 2 and 3 shipped with 58 songs on disk, while the Wii version, released at a later date, contained 5 additional songs that were released as downloadable content for the game. The European version of the game also includes 9 additional songs that have since been released as downloadable content for other regions. The player can expand their music library on the Xbox 360 and PlayStation 3 versions by purchasing new songs offered on a weekly basis through the consoles' respective store systems. A full list of downloadable songs is available. For the PlayStation 2 and Wii versions of Rock Band, Harmonix has created Rock Band Track Packs that contain a selection of the downloadable content already offered.
With Rock Band 2 and Rock Band 3, Xbox 360 and PlayStation 3 players can export a majority of songs from the Rock Band soundtrack to their console's storage device by purchasing a \"transfer license\". Additionally, certain songs rated as \"Family Friendly\" by Harmonix are playable in Lego Rock Band. \"Enter Sandman\", \"Moonson\", \"Paranoid\" and \"Run to the Hills\" cannot be exported to any other game in the series. The original recording of \"Run to the Hills\" was made available as a downloadable single and also in Iron Maiden Pack 01 on June 9, 2009. While initially not exportable to Rock Band 3, \"Black Hole Sun\" and \"Dani California\" were made available via a patch released on November 8, 2011. On the European version, \"Hier Kommt Alex\" & \"Rock 'n' Roll Star\" can be exported to Rock Band 2 but not Rock Band 3. Exports of the Rock Band soundtrack (with the above exclusions) into Rock Band 4, for those that have already exported them into Rock Band 2 or 3, was enabled in January 2016.

",
		"image": "List of songs in Rock Band.jpg"
	}
]