[
	{
		"id": "R. E. Robertson",
		"content": "Ralph Elliott Robertson (October 18, 1885 – February 28, 1961), more commonly known as R. E. \"Bob\" Robertson, was an American lawyer and politician from the territory and state of Alaska.  He was a member of the Republican Party.
Born in Sioux City, Iowa, Robertson was educated at Omaha Commercial College, the Michigan College of Mines and the University of Washington.  He moved to Alaska in 1906 and served as mayor of Juneau from 1920 to 1923.  He also served as a trustee of the Alaska Agricultural College and School of Mines, from 1925 to 1933.
In 1955, he was elected to the Alaska Constitutional Convention as one of seven at-large delegates from the First Judicial Division.  He resigned from the convention several days prior to the scheduled document signing and returned to Juneau, citing numerous issues with the finished document which he had not expressed previously.  His major objection was over the apportionment of the legislature into smaller districts;  the territorial legislature's districts were coterminous with that of the four judicial divisions established by the U.S. Congress in 1909.  Robertson did later agree to append his signature to the document, which happened shortly before his death.
He was nominated by the Republican Party to run in Alaska's first U.S. Senate election in 1958, but he lost in a massive landslide to Democrat Bob Bartlett, winning just 15% against Bartlett's 84%.  Robertson died on February 28, 1961 in Seattle, Washington.He founded the law firm of Robertson, Monagle, Eastaugh and Annis, which through minor changes in name over the years has remained one of Alaska's major law and lobbying firms.  The firm made headlines in the 21st century during the candidacy of Sarah Palin for the office of Vice President of the United States, due to an association dating back to her days as mayor of Wasilla.  Robertson's son-in-law, Frederick Orlebar Eastaugh (1913–1992), was a partner in the law firm and a notable political figure in Juneau for many years.  His grandson, Robert Ladd Eastaugh (born 1943), who was also associated with the firm at one point, was an associate justice of the Alaska Supreme Court from 1994 until retiring in 2009.

",
		"image": "R. E. Robertson.jpg"
	}
]