[
	{
		"id": "RAJAR",
		"content": "Radio Joint Audience Research Limited (RAJAR) was established in 1992 to operate a single audience measurement system for the radio industry in the United Kingdom. RAJAR is jointly owned by the BBC and RadioCentre. RAJAR's predecessor was called Joint Industry Committee on Radio Audience Research (JICRAR). Prior to this, the BBC and RadioCentre's predecessor CRCA carried out their own measurements independently of each other.
The company operates as a Joint Industry Committee (JIC) and its Board is chaired by an independent Chairman. It has shareholder representation from the BBC and the commercial sector, as well as the, Institute of Practitioners in Advertising (IPA) and the Incorporated Society of British Advertisers (ISBA). The company is a non- profit making entity.
RAJAR collects information on behalf of over 300 BBC and Ofcom Licensed commercial radio stations, ranging from very small local services to the national networks. Station listening by time, duration, platform (AM/FM, DAB, Online/APP, and DTV) and location (in car, at home, at work, or elsewhere) is recorded and published on a quarterly basis.
The research methodology is based on a continuous diary survey (ex. Christmas holidays) measuring the listening behaviour of over 54,000 adults (aged 15+) a year. The diary is filled in on a quarter-hour basis for one week's listening drawn from a sample representative of the individual station transmission area and the nation as a whole.  The fieldwork for the Research is carried out on behalf of RAJAR by specialist research contractors, currently Ipsos Mori. The sampling point framework is undertaken by RSMB Ltd.
The diary based system is the most common method of measuring radio audiences worldwide. Some countries have introduced electronic devices called audiometers. RAJAR has tested over recent years several audiometers but has not determined any viable for introduction in the UK market. RAJAR continues to work with developers to determine future viability of innovations with audio meters and any new measurement techniques that could be of use.
Historically, the data has been collected from respondents via a paper diary. From Quarter 3, 2011 RAJAR introduced an online version of a radio listening diary (Radio Diary) as an additional collection methodology. It is recognised that respondent engagement is critical to the continued quality of the survey and that by offering a choice as to how people record and return their listening data will help maintain the current high levels of participation and completion into the future. Additional benefits also include higher accuracy in attribution of listening to the different platforms (Digital/non digital) as well as higher in home completion that in turn enhances overall data quality.",
		"image": "RAJAR.jpg"
	}
]