[
	{
		"id": "Rajiv Gandhi Centre for Biotechnology",
		"content": "Shri Guruji Madhav Sadashiv Golwalkar National Centre for Complex Disease in Cancer and Viral Infection   is a research institute in India, exclusive devoted to research in Molecular Biology and Biotechnology. It is located at Thiruvananthapuram (Trivandrum), the capital city of the state of Kerala in India. This centre is an autonomous institute under the Department of Biotechnology of the Govt. of India.  Previously, it was an R&D centre under Kerala State Council for Science, Technology and Environment which is a funding agency for research Institutes and centers in Kerala.

The centre was inaugurated on 18 November 2002 by  then President of India, Dr. APJ Abdul Kalam. The institute has highly focused research departments working on different areas of biological sciences under following areas.

Cancer Research
Cardiovascular Disease & Diabetes Biology
Pathogen Biology
Regenerative Biology
Plant Biotechnology & Disease Biology
Neurobiology
Reproduction Biology
Transdisciplinary BiologyThe Center has a regional facility for Genetic Fingerprinting, which provides DNA analysis services for forensic & criminal investigations, paternity disputes, identification of wildlife remains, authentication of plants and seeds besides a battery of molecular diagnostics for genetic and infectious diseases. RGCB is also a major provider of laboratory and infrastructure services to other academic and research institutions. RGCB has a strength of 25 scientists, 120 Ph.D. students and around 100 research project staff. The centre has good infrastructural facilities for carrying out research in the field of Biotechnology. Financial support of Rs. 100 crores sanctioned by the Govt. of India in 2008, for a period of 3 years, apart from the yearly allocation of Rs. 25 crores, aims at making RGCB a world class research centre in the near future. RGCB is set to expand further into a second campus at Aakulum shortly. It would focus on R & D and also provide a unique\"TEST & PROVE \" facility to encourage biotechnology.
BioSpectrum magazine ranked Bio-Technology course at RGCB as second best in the country only after Institute of Chemical Technology, Mumbai.",
		"image": "Rajiv Gandhi Centre for Biotechnology.jpg"
	}
]