[
	{
		"id": "RAMPART-A",
		"content": "RAMPART-A is the code name for global mass surveillance and world-wide signals intelligence partnership program led by the United States National Security Agency (NSA). Aim of the program is to \"gain access to high-capacity international fiber-optic cables that transit at major congestion points around the world\".NSA is working with secret cooperation with the partner countries, which are hosting U.S. equipment and providing access to the fiber-optic cables. In 2013 the program had \"access to over 3 terabits per second of data streaming world-wide and encompasses all communication technologies such as voice, fax, telex, modem, email internet chat, virtual private network (VPN), voice over IP (VoIP), and voice call records\" and there were total of 37 partner countries including 17 European Union member states.There are two conditions on the partnership between the NSA and the partner country for making an agreement. The first one is that the partner countries will not use the NSA's technology to collect any data on U.S. citizens. The second one is that the NSA will not use the access it has been granted in the partner countries to collect data on the host countries' citizens. Although these conditions have exceptions, NSA doesn't state which those exceptions are. According to Edward Snowden, these agreements between the NSA and its partner countries are vague and are easily circumvented.The program was publicly revealed in June 2014, by the Danish newspaper Dagbladet Information and by The Intercept. Revelation of the program was based on as part of the leaks by the former NSA contractor Edward Snowden.
According to a NSA's classified intelligence briefing in 2010, RAMPART-A was used across all NSA Analysis and Production lines, and in the previous year (2009), over 9000 intelligence reports were written based solely on the RAMPART-A data.
The program cost about $170 million between 2011 and 2013. The program started in 1992.XKeyscore is implemented in the program's architecture.",
		"image": "RAMPART-A.jpg"
	}
]