[
	{
		"id": "Raymond Etherington-Smith",
		"content": "Raymond Broadley Etherington-Smith (11 April 1877 – 19 April 1913) was an English doctor and rower who competed for Great Britain in the 1908 Summer Olympics.
Etherington-Smith was born at Putney. He was educated at Repton School, and before going to university rowed for London Rowing Club, being a member of their Thames Cup crew in 1895 and of the eight that finished second in the Grand Challenge Cup in 1896. He went to Trinity College, Cambridge, where he was a member of the Pitt Club.  At Cambridge University he won the Colquhoun Sculls, the Lowe Double Sculls, the University Pairs and Fours, and rowed twice Head of the River. In 1898 he rowed for Cambridge University Boat Club in the Boat Race, which Oxford won. In 1899, he became President of the C.U.B.C when Cambridge prevented Oxford from gaining their tenth successive victory in the Boat Race and was in the victorious crew again in 1900.  At Henley Royal Regatta, he won the Grand Challenge Cup three times and the Stewards' Challenge Cup twice. He was runner-up in the Silver Goblets partnering William Dudley Ward in 1900 and runner-up in the Diamond Challenge Sculls against F.S. Kelly in 1902.   He was captain of Leander Club four times in 1903, 1905, 1906 and 1908.Etherington-Smith (nicknamed \"Ethel\") was captain of the Leander eight which won the gold medal for Great Britain rowing at the 1908 Summer Olympics. At age thirty-one he apologized to teammate Guy Nickalls who was ten years older: \"I suppose they have asked me because I am about half-way down the line between yourself and Bucknall in age.\"Etherington-Smith trained in medicine and became a demonstrator of anatomy at St Bartholomew's Hospital, having held the residential appointments, including that of House Surgeon.He died just after his thirty-sixth birthday from blood poisoning contracted while operating on a patient who had gangrene of the lung.",
		"image": "Raymond Etherington-Smith.jpg"
	}
]