[
	{
		"id": "RB-101",
		"content": "RB-101 is a drug that acts as an enkephalinase inhibitor, which is used in scientific research.
RB-101 is a prodrug which acts by splitting at the disulfide bond once inside the brain, to form two selective enzyme inhibitors and blocking both types of the zinc-metallopeptidase enkephalinase enzymes. This inhibits the breakdown of the endogenous opioid peptides known as enkephalins. These two enzymes, aminopeptidase N (APN) and neutral endopeptidase 24.11 (NEP), are responsible for the breakdown of both kinds of enkephalin naturally found in the body, and so RB-101 causes a buildup of both Met-enkephalin and Leu-enkephalin.These peptides act primarily at the delta opioid receptor, although they also stimulate the mu opioid receptor to some extent through a delta-opioid receptor mediated interaction with another peptide cholecystokinin, and the enzyme-inhibiting effects of RB-101 thus produce indirect stimulation of both of these opioid receptor subtypes. This causes RB-101 to be strongly synergistic with cholecystokinin antagonists, such as proglumide.Unlike the more commonly used enkephalinase inhibitor racecadotril, which only acts peripherally and has antidiarrheal effects, RB-101 is able to enter the brain, and thus produces a range of effects, acting as an analgesic, anxiolytic and antidepressant. The antidepressant and anxiolytic actions are thought to be mediated through the delta opioid receptor, while the analgesic effects most likely result from a mix of mu and delta activity. Animal studies suggest that RB-101 is also likely to be useful in relieving the symptoms of acute opioid withdrawal and in the management of opioid dependence.A significant advantage of inhibiting the breakdown of endogenous opioid peptides rather than stimulating opioid receptors with exogenous drugs is that the levels of opioid peptides are only increased slightly from natural levels, thus avoiding overstimulation and upregulation of the opioid receptors. This means that even when RB-101 is used in high doses for extended periods of time, there is no development of dependence on the drug or tolerance to its analgesic effects. Consequently, even though RB-101 is able to produce potent analgesic effects via the opioid system, it is unlikely to be addictive.Unlike conventional opioid agonists, RB-101 also failed to produce respiratory depression, which suggests it might be a much safer drug than traditional opioid painkillers. RB-101 also powerfully potentiated the effects of traditional analgesics such as ibuprofen and morphine, suggesting that it could be used to boost the action of a low dose of normal opioids which would otherwise be ineffective.RB-101 itself is not orally active and so has not been developed for medical use in humans, however modification of the drug has led to newer orally acting compounds such as RB-120 and RB-3007, which may be more likely to be adopted for medical use if clinical trials are successful.",
		"image": "RB-101.jpg"
	}
]