[
	{
		"id": "RCA VP 3000",
		"content": "RCA's VP 3000 Interactive Data Terminals were a family of portable computer terminals housed in compact cases similar to the Commodore VIC-20, but notable for their use of a color-coded membrane keyboard. The systems supported color output to a television with 20 and 40 character-per-line modes, and an optional built-in modem. It was first advertised in September 1982.
The VP series started life as an upgrade to RCA's COSMAC VIP kit-computer, originally to be known as the VIP II. Unlike the original VIP, which was a bare motherboard for hobbyists, the VIP II would be a complete home computer. Most of the new features were added through a series of expansion cards built into the chassis, most of which already existed as add-on cards for the VIP. Although some marketing material was produced in 1979, and RCA suggested it would be available \"some time next year\" at a price around $400, the VIP II was never released.
Instead, the design was re-purposed as a terminal system by replacing the ROMs with ones containing a simple terminal program and optionally adding a modem. The machines were otherwise the same as the VIP II, which is why it included color output, a \"tone generator\", and the relatively limited 40-column output in an era when 80-column was the standard for terminals.
The main model, the VP 3501 included a 300 bit/s modem, an RF modulator for connection to any conventional color television, and the keyboard included a 16-key numeric keypad. The VP 3303 removed the modem and keypad, while the VP 3301 removed the RF modulator as well. The terminals were quite inexpensive, with the 3501 selling for $275 (706 in 2019), while the 3301 was only $255.RCA also sold the systems as stand-alone keyboards as the VP 600 series. The VP 616 had an RS-232 serial port and calculator keypad while the VP 606 removed the keypad. The VP 611 replaced the 616's serial port with an 8-bit parallel port, suitable for being feeding into a typical microcomputer keyboard controller like the one on most S-100 bus machines. The VP 601 removed the keypad from the 611. The 616 sold for $68, while the 601 was only $56.",
		"image": "RCA VP 3000.jpg"
	}
]