[
	{
		"id": "RCA Victrola",
		"content": "RCA Victrola was a budget record label introduced by RCA Victor in the early 1960s to reissue classical recordings originally released on the RCA Victor \"Red Seal\" label.  The name 'Victrola' was the trademark for early console phonographs with enclosed horns first marketed by the Victor Talking Machine Company in 1906. The 'Victrola' trademark also appeared on most Red Seal records (rather than 'Victor') issued in the US from around 1909 until 1914, then from 1917 until early 1934. The RCA Victrola label replaced the older RCA Camden label for budget classical reissues, the Camden label now mostly reissuing budget recordings drawn from RCA Victor's pop and country catalog.   Many early reissues on the RCA Victrola label included recordings from the historic RCA Victor \"Living Stereo\" series first released in 1958, using triple channel stereophonic tapes recorded as early as 1954.  There were also some first stereo issues of recordings that had previously been available only in monophonic versions. For several years, Victrola released both stereo and mono versions of many albums, many of them in \"reprocessed\" (fake) stereo.From the liner notes of several RCA Victrola releases from the early 1960s:

There are certain similarities
between RCA Victrola records and paperback reprints of good books. In both instances works of merit are reissued in lower-priced editions.
But the comparison stops there. A paperback is printed in smaller, less readable type on paper inferior to that used in the original. In the case of RCA Victrola records, the sound characteristics are exactly the same as those of the original Red Seal edition, and all Victrola reissues are those of recent recordings, using late techniques developed by RCA Victor. Furthermore, Victrola records use exactly the same high-quality standards as current Red Seal records.

The result is that memorable performances of great masterpieces of music are not only preserved but also priced for wider distribution, appealing, we hope, to a wider public. Even the jackets of Victrola records are, we think, notable. Some of the world's greatest drawings by artists classic and modern appear on these covers.
A similar statement had previously appeared on several releases from the budget RCA Camden label.",
		"image": "RCA Victrola.jpg"
	}
]