[
	{
		"id": "Real ID Act",
		"content": "The Real ID Act of 2005, Pub.L. 109–13 (text) (pdf), 119 Stat. 302, enacted May 11, 2005, is an Act of Congress that modifies U.S. federal law pertaining to security, authentication, and issuance procedure standards for drivers' licenses and identity documents, as well as various immigration issues pertaining to terrorism.
The law sets forth requirements for state drivers' licenses and ID cards to be accepted by the federal government for \"official purposes\", as defined by the Secretary of the United States Department of Homeland Security. The Secretary of Homeland Security has defined \"official purposes\" as boarding commercially operated airline flights, and entering federal buildings and nuclear power plants, although the law gives the Secretary unlimited authority to require a \"federal identification\" for any other purposes.The Real ID Act implements the following:

Title II of the act establishes new federal standards for state-issued drivers' licenses and non-driver identification cards.
Changing visa limits for temporary workers, nurses, and Australian citizens.
Funding some reports and pilot projects related to border security.
Introducing rules covering \"delivery bonds\" (similar to bail, but for aliens who have been released pending hearings).
Updating and tightening laws on application for asylum and deportation of aliens for terrorism.
Waiving laws that interfere with construction of physical barriers at the borders.On December 20, 2013, the Department of Homeland Security announced that implementation of Phase 1 would begin on January 20, 2014, which followed a yearlong period of \"deferred enforcement\". There are four planned phases, three of which apply to areas that affect relatively few people—e.g., DHS headquarters, nuclear power plants, and restricted and semi-restricted federal facilities such as military bases. On January 8, 2016, DHS issued an implementation schedule for Phase 4, stating that starting January 22, 2018, passengers with a driver's license issued by a state that is not compliant with the REAL ID Act (and has not been granted an extension) will need to show an alternative form of acceptable identification for domestic air travel to board their flight. Starting October 1, 2021 (originally scheduled for October 1, 2020 but was postponed a year due to a global coronavirus pandemic), every air traveler will need a REAL ID–compliant license or another acceptable form of identification (such as a U.S. passport, U.S. passport card, U.S. military card, or DHS trusted traveler card, e.g. Global Entry, NEXUS, SENTRI, FAST) for domestic air travel. As of December 2020, all states and territories have been certified as compliant except American Samoa and the Northern Mariana Islands, which are under review.",
		"image": "Real ID Act.jpg"
	}
]