[
	{
		"id": "Reducing emissions from deforestation and forest degradation",
		"content": "Reducing emissions from deforestation and forest degradation and the role of conservation, sustainable management of forests and enhancement of forest carbon stocks in developing countries (REDD+) was first negotiated under the United Nations Framework Convention on Climate Change (UNFCCC) in 2005, with the objective of mitigating climate change through reducing net emissions of greenhouse gases through enhanced forest management in developing countries. Most of the key REDD+ decisions were completed by 2013, with the final pieces of the rulebook finished in 2015.
In the last two decades, various studies estimate that land use change, including deforestation and forest degradation, accounts for 12-29% of global greenhouse gas emissions. For this reason the inclusion of reducing emissions from land use change is considered essential to achieve the objectives of the UNFCCC.During the negotiations for the Kyoto Protocol, and then in particular its Clean Development Mechanism (CDM), the inclusion of tropical forest management was debated but eventually dropped due to anticipated methodological difficulties in establishing – in particular – additionality and leakage (detrimental effects outside of the project area attributable to project activities). What remained on forestry was \"Afforestation and Reforestation\", sectoral scope 14 of the CDM. Under this sectoral scope areas of land that had no forest cover since 1990 could be replanted with commercial or indigenous tree species. In its first eight years of operation 52 projects had been registered under the \"Afforestation and Reforestation\" scope of the CDM. The cumbersome administrative procedures and corresponding high transaction costs are often blamed for this slow uptake. Beyond the CDM, all developed countries that were parties to the Kyoto Protocol also committed to measuring and reporting on efforts to reduce net greenhouse gas emissions from forests. The United States also measures and reports on the net greenhouse gas sequestration in its forests.
The Coalition for Rainforest Nations (CfRN) created REDD+ mechanisms which encouraged positive incentives for the reduction of emissions of greenhouse gases stemming from tropical deforestation and forest degradation as a climate change mitigation measure.",
		"image": "Reducing emissions from deforestation and forest degradation.jpg"
	}
]