[
	{
		"id": "Reformed Presbyterian Church of North America",
		"content": "The Reformed Presbyterian Church of North America (RPCNA) is a Presbyterian church with congregations and missions throughout the United States, Canada, and Japan. Its beliefs—formulated via membership in the Reformed Presbyterian Church and RP Global Alliance—place it in the conservative wing of the Reformed family of Protestant churches. Below the Bible—which is held as divinely inspired and without error—the church is committed to several \"subordinate standards,\" together considered with its constitution: the Westminster Confession of Faith and Larger and Shorter Catechisms, along with its Testimony, Directory for Church Government, the Book of Discipline, and Directory for Worship.  
Primary doctrinal distinctions which separate the RPCNA from other Reformed and Presbyterian denominations in North America are: its continued adherence to the historical practice of Reformed Christianity, contained in the Westminster Confession of Faith, of practicing exclusive psalmody, and its continuing affirmation of Jesus as mediatorial king, ruling over all nations. Prior to the 1960s, the RPCNA refused to vote or participate in government in the United States due to it not directly acknowledging Christ's authority over it, and since has continued (at some times more heavily than others), to lobby the federal government to expressly submit to the authority of Jesus Christ in the U.S. Constitution.
The RPCNA has a long history, having been a separate denomination in the United States since colonial days. In Scotland (where the denomination originated), Reformed Presbyterians have been a separate branch since the late 17th century, and prior to that, a part of the original Presbyterian Church of Scotland that came out of the Protestant Reformation in the 16th century.
As its name suggests, the RPCNA is governed through the presbyterian system (which the church considers to be the only divinely-appointed method of church government), with each individual congregation being governed by two or more elders. As with most Presbyterian denominations, the RPCNA is divided into several presbyteries, but unlike several other smaller Presbyterian denominations, the supreme governing body is a single synod, not a general assembly. Each congregation may send one ruling elder delegate (two for larger congregations) to its presbytery meeting, as well as to the annual Synod meeting. Each minister (teaching elder), whether serving as the pastor of a congregation or not, is automatically a delegate to his presbytery and to the synod.",
		"image": "Reformed Presbyterian Church of North America.jpg"
	}
]