[
	{
		"id": "RID (insect repellent)",
		"content": "RID is an Australian brand of personal insect repellent sold and distributed in Australia, New Zealand, and online.
It was the first insect repellent invented in Australia, in 1956. It is applied topically to exposed skin or clothing to repel mosquitoes, sandflies, midges, flies, fleas, ticks, head lice, mites, and other insect pests. RID is available in a variety of formulations such as aerosols, creams, and pump sprays. 
RID contains these active ingredients: DEET (N,N-diethyl-m-toluamide), di-n-propyl isocinchomeronate (a fly repellent), N-octyl bicycloheptene dicarboximide (an insecticide synergist), and triclosan (an antimicrobial agent which kills a broad range of bacteria). Although RID once contained DDT as an active ingredient, it has since been removed when the effects of this highly toxic substance became more known worldwide.
According to the American Mosquito Control Association's Web site, DEET remains the standard by which all other repellents are judged. DEET was developed by the U.S. Department of Agriculture and was registered for use by the general public in 1957.  It is effective against mosquitoes, biting flies, chiggers, fleas and ticks. These insect repellents slowly evaporate into the air, producing an invisible chemical barrier around the areas on the body and clothes where it is applied, repelling incoming insects.RID was invented in 1956, after 3,000 hours of field research by inventor Doug H. Thorley. A bottle of RID is exhibited at the Queensland Museum in Australia.
RID insect repellents are used to repel insects which may carry a number of diseases, including Ross River virus, dengue fever, West Nile virus, malaria, yellow fever, Japanese B encephalitis, filariasis, Lyme disease, leishmaniasis, typhus fever, plague, and Eastern equine encephalitis.
As an insect repellent, RID is not able to protect people from these diseases beyond repelling some of the insects that may transmit them.",
		"image": "RID (insect repellent).jpg"
	}
]