[
	{
		"id": "Roger Keesing",
		"content": "Professor Roger Martin Keesing (16 May 1935 – 7 May 1993) was a linguist and anthropologist, most notable for his fieldwork on the Kwaio people of Malaita in the Solomon Islands, and his writings on a wide range of topics including kinship, religion, politics, history, cognitive anthropology and language. Keesing was a major contributor to anthropology.He was the son of anthropologists, Felix M. Keesing, another distinguished anthropologist with an interest in the South Pacific and Marie Margaret Martin Keesing, also an anthropologist of the Pacific. Keesing studied at Stanford and Harvard and began work in 1965 at the University of California, Santa Cruz. In 1974 he became a professor at the Institute of Advanced Studies at the Australian National University in Canberra, heading the Department of Anthropology from 1976. In 1990 he moved to McGill University in Montreal.
In 1974 he wrote a famous article, one of around a hundred published over the course of his career, defining and specifying a view of culture inspired by linguistics and Marxian thinking. He also wrote several books, and is perhaps best known among students of anthropology as the author of Cultural Anthropology: A Contemporary Perspective, regarded as one of the most authoritative general introductory works on the subject. This was based on a book originally authored by his father, and was extensively revised by Keesing over the course of many years, beginning with an updated edition of the original in 1971, and continuing with a full rewrite in 1976, revised further in 1981. Since Keesing's death this task was taken up by Dr Andrew Strathern, and the book remains popular.
In 1989, Keesing worked closely with the author to translate Jonathan Fifi'i's autobiography, From Pig-Theft to Parliament: My Life between Two Worlds, which chronicled his life from his poor Kwaio origins through to the Maasina Ruru movement and onto his career as a politician.
Keesing died suddenly of a heart attack at the Canadian Anthropology Society dance and reception in 1993, and his ashes were transferred to the Solomon Islands, where the families of his Kwaio associates accord him the status of an andalo or ancestral spirit.",
		"image": "Roger Keesing.jpg"
	}
]