[
	{
		"id": "RT- The Life and Music of Richard Thompson",
		"content": "RT- The Life and Music of Richard Thompson is a box set by Richard Thompson, released in February 2006.
This box set gives an extensive overview of Thompson's long career without including content from any of his mainstream albums.
While many of the songs included will be familiar to Thompson fans, the actual tracks are mostly live and nearly all previously unreleased, and the arrangements are often different from those of the original recording. Thompson himself granted the compilers access to his personal archives of recordings and photos, and other collectors of Thompsonia (most notably American record producer Edward Haber) also contributed to the set. Thompson retained (and exercised) the right of veto over any aspect of the set.
Of particular interest are live tracks by Richard and Linda Thompson (including a few from 
the  1982 \"tour from hell\"), songs demoed for his first solo album Henry The Human Fly as well as several of Thompson's comic songs (\"Madonna's Wedding\" and his lampooning of Janet Jackson's infamous breast baring moment at the Super Bowl) and several songs that Thompson himself has never released.
The set also includes a 168-page book – consisting of a biography, an exclusive interview and track notes – and a reproduction of a Vincent motorcycle catalogue (a reference to Thompon's best loved song “1952 Vincent Black Lightning”). As with the actual track selection Thompson had input into the book and was involved in the proofreading and supplied some of the photos that are included.  Despite this interaction by the artist, the booklet is riddled with typographical errors.
The five CDs are themed, which gives each disc a specific focus and helps to give this large set some cohesion.

Songs based on real persons and events
Essential songs
Epic live performances
Thompson covering other artists' songs, or playing as a session musician.
RaritiesA sixth CD \"RT on FR\" is available free of charge by returning a coupon included in the box.",
		"image": "RT- The Life and Music of Richard Thompson.jpg"
	}
]