[
	{
		"id": "RTÉ Performing Groups",
		"content": "RTÉ Performing Groups is a group of five classical ensembles, part of the Irish broadcaster Raidió Teilifís Éireann (RTÉ). All but the Vanbrugh Quartet are based in Dublin (Vanbrugh are based in Cork).
The RTÉ Performing Groups are made up of the RTÉ National Symphony Orchestra, the RTÉ Concert Orchestra, the RTÉ Vanbrugh Quartet, the RTÉ Philharmonic Choir and the children's choir RTÉ Cór na nÓg. The five groups present over 250 events annually, including live performances and work in education. The groups are largely funded by licence fee revenue.In 2018, both orchestras celebrated 70 years in existence. Between the RTÉ National Symphony Orchestra and the RTÉ Concert Orchestra, a total of 134 professional musicians are employed. The RTÉ Philharmonic Choir and the children's choir RTÉ Cór na nÓg are for singers at an amateur level. Presently, approximately 200 adults and children are incorporated in the choirs.

The five groups present up to 250 events every year, most of these being live concerts. Most of these performances take place in Dublin, mostly in the National Concert Hall but some in The Helix and the National Gallery of Ireland. There is a variety of high-end classical music with the RTÉ National Symphony Orchestra and the RTÉ Vanbrugh Quartet to RTÉ Concert Orchestra concerts in the fields of jazz and big band, classical crossover, rock music, Irish traditional music, cabaret, multimedia events, family concerts and more.
High-profile Irish and international artists who have recently appeared with the RTÉ National Symphony Orchestra include Han-Na Chang, Louis Lortie and Ann Murray, while acclaimed guests in the orchestra's history included Sir John Barbirolli, Vladimir Ashkenazy, Joan Sutherland and Mstislav Rostropovich. RTÉ Concert Orchestra guests have included Luciano Pavarotti, Plácido Domingo, José Carreras and Kiri Te Kanawa, and more recently Cleo Laine and John Dankworth, Duke Special, Ute Lemper and Katherine Jenkins.
In 2007, all groups featured on a stamp. One million stamps were printed.The five groups play approximately two concerts a week, a number which can increase at certain times of year.",
		"image": "RTÉ Performing Groups.jpg"
	}
]