[
	{
		"id": "Single-stage-to-orbit",
		"content": "A single-stage-to-orbit (or SSTO) vehicle reaches orbit from the surface of a body using only propellants and fluids and without expending tanks, engines, or other major hardware. The term usually, but not exclusively, refers to reusable vehicles. To date, no Earth-launched SSTO launch vehicles have ever been flown; orbital launches from Earth have been performed by either fully or partially expendable multi-stage rockets.
The main projected advantage of the SSTO concept is elimination of the hardware replacement inherent in expendable launch systems. However, the non-recurring costs associated with design, development, research and engineering (DDR&E) of reusable SSTO systems are much higher than expendable systems due to the substantial technical challenges of SSTO, assuming that those technical issues can in fact be solved.It is considered to be marginally possible to launch a single-stage-to-orbit chemically-fueled spacecraft from Earth. The principal complicating factors for SSTO from Earth are: high orbital velocity of over 7,400 metres per second (27,000 km/h; 17,000 mph); the need to overcome Earth's gravity, especially in the early stages of flight; and flight within Earth's atmosphere, which limits speed in the early stages of flight and influences engine performance.Advances in rocketry in the 21st century have resulted in a substantial fall in the cost to launch a kilogram of payload to either low Earth orbit or the International Space Station, reducing the main projected advantage of the SSTO concept.
Notable single stage to orbit concepts include Skylon, the DC-X, the Lockheed Martin X-33, and the Roton SSTO. However, despite showing some promise, none of them has come close to achieving orbit yet due to problems with finding a sufficiently efficient propulsion system.Single-stage-to-orbit is much easier to achieve on extraterrestrial bodies that have weaker gravitational fields and lower atmospheric pressure than Earth, such as the Moon and Mars, and has been achieved from the Moon by the Apollo program's Lunar Module, by several robotic spacecraft of the Soviet Luna program, and by China's Chang'e 5.",
		"image": "Single-stage-to-orbit.jpg"
	}
]