[
	{
		"id": "SN 185",
		"content": "SN 185 was a transient astronomical event observed in AD 185, likely a supernova. The transient occurred in the direction of Alpha Centauri, between the constellations Circinus and Centaurus, centered at RA 14h 43m  Dec −62° 30′, in Circinus. This \"guest star\" was observed by Chinese astronomers in the Book of Later Han (后汉书), and might have been recorded in Roman literature. It remained visible in the night sky for eight months. This is believed to be the first supernova for which records exist.
The Book of Later Han gives the following description:

In the 2nd year of the epoch Zhongping [中平], the 10th month, on the day Kwei Hae [癸亥] [December 7, Year 185], a 'guest star' appeared in the middle of Nan Mun [asterism containing Alpha Centauri], The size was half a bamboo mat. It displayed various colors, and gradually lessened. In the 6th month of the succeeding year it disappeared.
The gaseous shell RCW 86 is probably the supernova remnant of this event and has a relatively large angular size of roughly 45 arc minutes (larger than the apparent size of the full moon, which varies from 29 to 34 arc minutes). The distance to RCW 86 is estimated to be 2,800 parsecs (9,100 light-years). Recent X-ray studies show a good match for the expected age.Infrared observations from NASA's Spitzer Space Telescope and Wide-field Infrared Survey Explorer (WISE) reveal how the supernova occurred and how its shattered remains ultimately spread out to great distances. The findings show that the stellar explosion took place in a hollowed-out cavity, allowing material expelled by the star to travel much faster and farther than it would have otherwise.Differing modern interpretations of the Chinese records of the guest star have led to quite different suggestions for the astronomical mechanism behind the event, from a core-collapse supernova to a distant, slow-moving comet – with correspondingly wide-ranging estimates of its apparent visual magnitude (−8 to +4). The recent Chandra results suggest that it was most likely a Type Ia supernova (a type with consistent absolute magnitude), and therefore similar to Tycho's Supernova (SN 1572), which had apparent magnitude −4 at a similar distance.",
		"image": "SN 185.jpg"
	}
]