[
	{
		"id": "Steve Dunne (cricket umpire)",
		"content": "Robert Stephen Dunne (born 22 April 1943) was a New Zealand cricket umpire.  He was the first umpire to stand in 100 ODIs.Steve Dunne was born in Dunedin, Otago.  He is married with two sons.  Before becoming an umpire, he played in one first-class match for New Zealand Under-23s in March 1966 and five first-class matches for Otago in the Plunket Shield in 1968/9, mainly as a left-arm medium-paced bowler.  He took 10 wickets at a bowling average of 41.10.  He averaged a paltry 4.28 with the bat.
He umpired 39 Test matches and 100 ODIs between 1989 and 2002.  His first 12 Tests were in New Zealand.  In 1994, he and Brian Aldridge were the two New Zealand representatives on the first international panel of umpires, set up by the ICC to ensure that one neutral umpire would stand in every Test match (later supplemented by the Elite Panel of ICC Umpires).In the 2nd ODI between New Zealand and Pakistan in December 1992, at McLean Park in Napier, he made the first run out decisions in New Zealand by a television third umpire.He stood with Darrell Hair in the Boxing Day Test between Australia and Sri Lanka at the Melbourne Cricket Ground in 1995, in which Hair no-balled Muttiah Muralitharan for throwing.  Dunne was criticised for failing to back Hair by similarly calling no-ball later in the match when Muralitharan bowled from Dunne's end, but he later defended himself, saying that the decision was too difficult to make on the field, and that he backed a previous decision to refer a bowler with a suspect action to the International Cricket Council for further investigation.  In 2001, he and Doug Cowie reported Shoaib Akhtar after an ODI in at Carisbrook in Dunedin.He stood in four matches in the 1996 Cricket World Cup, including the semi-final between India and Sri Lanka at Eden Gardens in Calcutta, which was abandoned due to the rioting crowd after India lost their eighth wicket chasing the Sri Lankan score.  The match was awarded to Sri Lanka.   He also umpired in five matches in the 1999 Cricket World Cup.  In 1999/2000, he stood in Pakistan's first Test match in India for 12 years, and the first Test between the sides for 9 years, at the M. A. Chidambaram Stadium in Chennai.His 100th ODI was the match between New Zealand and England at his home ground in Dunedin on 26 February 2002.  He had also stood in his first ODI at Carisbrook, just over 13 years earlier.
He retired after he was not chosen as one of the eight umpires on the Elite Panel of ICC Umpires as he was considered not good enough for the modern game.  He published an autobiographical account of his experiences, Alone in the Middle, in 2003.",
		"image": "Steve Dunne (cricket umpire).jpg"
	}
]