[
	{
		"id": "Underground City, Montreal",
		"content": "RÉSO, commonly referred to as the Underground City (French: La ville souterraine), is the name applied to a series of interconnected office towers, hotels, shopping centres, residential and commercial complexes, convention halls, universities and performing arts venues that form the heart of Montreal's central business district, colloquially referred to as Downtown Montreal. The name refers to the underground connections between the buildings that compose the network, in addition to the network's complete integration with the city's entirely underground rapid transit system, the Montreal Metro. Moreover, the first iteration of the Underground City was developed out of the open pit at the southern entrance to the Mount Royal Tunnel, where Place Ville Marie and Central Station stand today.

Though most of the connecting tunnels pass underground, many of the key passageways and principal access points are located at ground level, and there is also one skybridge (between Lucien-L'Allier Metro station and Gare Lucien L'Allier). In this regard, the Underground City is more of an indoor city (ville intérieure) than a truly subterranean city, although there are vast commercial sectors located entirely underground.
The network is particularly useful during Montreal's long winters, during which time well over half a million people are estimated to use it every day. The network is largely climate controlled and well-lit, and is arranged in a U-shape with two principal north–south axes connected by an east–west axis. Combined, there are 32 kilometres (20 mi) of tunnels over 12 square kilometres (4.6 sq mi) of the most densely populated part of Montreal. In total, there are more than 120 exterior access points to the network, not including the sixty or so Metro station entrances located outside the official limits of the RÉSO, some of which have their own smaller tunnel networks. Some of the city's larger institutions, namely McGill University, the Montreal Museum of Fine Arts, Concordia University and the Université de Montréal, also have campus tunnel networks separate from the Underground City.

",
		"image": "Underground City, Montreal.jpg"
	}
]